Repository: FreezePeace1/WebChat-Backend
Catalog: SIPBackend.Application/Resources/ErrorMessage.*.resx
Languages: ru

# FailedToRegisterUser
source: Failed to regiter user
ru: Не удалось зарегистрировать пользователя

source: Failed to login user
ru: Не удалось авторизоваться пользователю

source: Failed to send message with resetting token
ru: Не удалось отправить сообщение на почту о восстановлении пароля пользователю

source: Failed to reset password
ru: Не удалось обновить пароль

source: Failed to change info
ru: Не удалось изменить информацию

source: Failed to get account info
ru: Не удалось получить инофрмацию об аккаунте

source: User already exists
ru: Пользователь уже существует

source: Passwords are not equal
ru: Проверьте правильность паролей

source: Model creating is failed
ru: Не удалось создать модель

source: Failed to logout
ru: Не удалось разлогиниться

source: User not exists
ru: Пользователь не существует

# IncorrectCredentials
source: Check your credentials
ru: Проверьте свой логин или пароль

source: User are not authorized
ru: Пользователь не авторизован

source: Failed to change user info
ru: Не удалось изменить информацию о пользователе

source: Tokens are not equal
ru: Токены сброса пароля не равны

source: Resetting password token is invalid
ru: Токен восстановления пароля не валиден

source: Failed to send message
ru: Не удалось отправить сообщение

source: Failed to add new friend
ru: Не удалось добавить нового друга

source: Failed to get friends
ru: Не удалось получить друзей

source: Failed to delete friend
ru: Не удалось удалить друга

source: Failed to find friend
ru: Не удалось удалить друга

# UsersAreAlreadyFriends
source: Users are already friends or request on friendship already is sent!
ru: Пользователи уже друзья или запрос на дружбу уже отправлен

source: Users are not friends
ru: Пользователи не являются друзьями

source: Failed to accept request
ru: Не удалось принять запрос на дружбу

source: Failed to get all users with requests
ru: Не удалось получить всех пользователей с запросами на дружбу

source: Failed to get user info
ru: Не удалось получить информацию о пользователе

# FailedToGetRefreshToken
source: Faield to get refresh token
ru: Не удалось получить refresh token

source: Failed to get all messages
ru: Не удалось получить все сообщения

source: Getting chat info is failed
ru: Не удалось получить информацию о чате

source: Chat does not exist
ru: Чат не существует

source: These chat participants do not exist
ru: Этих участников чата не существует

source: Getting calling story is failed
ru: Не удалось получить историю звонков

source: Calling story already exists
ru: История звонков уже существует и не требует добавления в БД

source: Failed to add new calling story
ru: Не удалось добавить новую историю звонков

source: Failed to find calling story
ru: Не удалось найти историю звонков

source: Failed to end calling story
ru: Не удалось закончить звонок

source: Failed to create new chat room
ru: Не удалось создать новую команту

source: Getting users webchat room is failed
ru: Получение комнаты пользователей неуспешно

source: Call already exists
ru: Звонок уже существует
