Repository: FreezePeace1/WebChat-Backend
Catalog: SIPBackend.Application/Resources/SuccessMessage.*.resx
Languages: ru

source: Logout is succeed
ru: Пользователь успешно вышел из аккаунта

source: Account has reached successfully
ru: Пользователь зашел на аккаунт успешно

source: User info is changed successfully
ru: Информация пользователя успешно изменена

source: Resetting password token is activated
ru: Токен сброса пароля активирован

source: Message was sent successfully
ru: Сообщение было доставлено успешно

source: Sending resetting password token is successful
ru: Токен сброса пароля успешно отправлен и сохранен в бд

source: Friend added successfully
ru: Друг добавлен успешно

source: Getting friends is successful
ru: Получение друзей успешно

source: Deleting friend is successful
ru: Удаление друга произошло успешно

source: Finding friend is successful
ru: Друг нашелся

source: Friend's request approved
ru: Запрос на дружбу принят

source: Getting all users with requests
ru: Получили всех пользователей с запросами на дружбу

source: Refresh token got successfully
ru: Refresh token получен успешно

# GettingAllMessagesIsSuccessfull
source: Getting all messages is successful
ru: Удачно получены все сообщения

source: Getting chat info is successful
ru: Получение всей информации для чата успешно

source: Getting calling story is successfull
ru: Получение истории звонков успешно

source: New calling story is added successfully
ru: Новая история звонков добавлена успешно

source: Call is ended successfully
ru: Звонок завершен успешно

# NewChatRoomIsCreatedSuccessfully
source: New chat room is create successfully
ru: Новая комната создана успешно

source: Getting users web chat room is successfull
ru: Получение комнаты пользователей успешно

source: Getting room info is successful
ru: Получение информации о комнате успешно
